---
kind: method
id: M:Autodesk.Revit.DB.SketchedStairsCurveData.GetCurve
source: html/ad0a68ac-732a-19fe-eeed-2eaee5652285.htm
---
# Autodesk.Revit.DB.SketchedStairsCurveData.GetCurve Method

Get a copy of the curve that is formed along this boundary.

## Syntax (C#)
```csharp
public Curve GetCurve()
```

## Returns
A copy of the curve.